//Перем м, S0, mu, sigma, n, V0, T, альфа, n_симуляций;

//Процедура Инициализация()
//    м = 10; // Количество видов ценных бумаг
//    S0 = Новый Массив(м);
//    mu = Новый Массив(м);
//    sigma = Новый Массив(м);
//    n = Новый Массив(м);
//    
//    Для i = 0 По м - 1 Цикл
//        S0[i] = СлучайноеЧисло(0, 100); // Начальная стоимость
//        mu[i] = СлучайноеЧисло(0, 1);   // Ожидаемая доходность
//        sigma[i] = СлучайноеЧисло(0, 1); // Волатильность
//        n[i] = Цел(СлучайноеЧисло(1, 10)); // Количество акций
//    КонецЦикла;
//    
//    T = 1.5; // Горизонт прогнозирования
//    альфа = 0.95; // Уровень доверия
//    n_симуляций = 10000; // Количество симуляций
//    
//    V0 = V(0); // Начальная стоимость портфеля
//КонецПроцедуры

//Функция НормальноеРаспределение()
//    // Метод Бокса-Мюллера для генерации нормально распределенных случайных чисел
//    u1 = СлучайноеЧисло(0, 1);
//    u2 = СлучайноеЧисло(0, 1);
//    z0 = КвКорень(-2 * Лог(u1)) * Кос(2 * Пи() * u2);
//    Возврат z0;
//КонецФункции

//Функция S(i, T)
//    Возврат S0[i] * Эксп((mu[i] - 0.5 * sigma[i] ** 2) * T + sigma[i] * КвКорень(T) * НормальноеРаспределение());
//КонецФункции

//Функция V(t)
//    сумма = 0;
//    Для i = 0 По м - 1 Цикл
//        сумма = сумма + n[i] * S(i, t);
//    КонецЦикла;
//    Возврат сумма;
//КонецФункции

//Функция ВычислитьVaR()
//    потери = Новый Массив(n_симуляций);
//    
//    Для i = 0 По n_симуляций - 1 Цикл
//        потери[i] = V0 - V(T);
//    КонецЦикла;
//    
//    // Сортировка массива потерь
//    потери.Сортировать();
//    
//    // Вычисление VaR
//    индекс = Цел((1 - альфа) * n_симуляций);
//    VaR_альфа = потери[индекс];
//    
//    Возврат VaR_альфа;
//КонецФункции

//&НаКлиенте
//Процедура Сгенерировать(Команда)
//    Инициализация();
//    
//    VaR_альфа = ВычислитьVaR();
//    
//    Сообщить("Value at Risk (VaR) при уровне доверия " + Формат(альфа * 100, "ЧГ=0") + "%: " + Формат(VaR_альфа, "ЧГ=2"));
//КонецПроцедуры

//Основная();